---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Int.Integer
source: html/6325e901-7735-2112-f749-ca7b2dbc19fb.htm
---
# Autodesk.Revit.DB.SpecTypeId.Int.Integer Property

Integer, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Integer { get; }
```